// Да се дефинира класа MobilePhone во која ќе се чуваат податоци за еден мобилен телефон:
// модел (низа од карактери не подолга од 20 карактери)
// број на модел (цел број)
// година на издавање (цел број)
// За класата да се дефинира default конструктор, конструктор со аргументи, copy конструктор,
// деструктор и доколку има потреба get методи. Исто така да се дефинира и фунцкија за печатење
// на информации за класата која ќе печати во следниот формат „(модел) (број на модел)
// release year: (година на издавање)“.
// Потоа да се дефинира класа Owner во која се чуваат следните информации:
// име (низа од карактери не подолга од 20 карактери)
// презиме (низа од карактери не подолга од 20 карактери)
// мобилен телефон (објект од класа MobilePhone)
// Да се креира default конструктор, конструктор со аргументи, деструктор и
//  доколку има потреба get методи. Исто така да се дефинира и функција за печатење
//   на информации за класата која ќе печати во следниот формат:
// „(име) (презиме) has a mobile phone:
// (информации за мобилен телефон)“
#include <iostream>
using namespace std;

class MobilePhone
{
private:
    string model;
    int br_model;
    int godina;

public:
    MobilePhone() {}
    MobilePhone(string m, int brm, int god)
    {
        model = m;
        br_model = brm;
        godina = god;
    }
    ~MobilePhone() {}
};

int main()
{
}